app/views/posts/new.html.erb


    <%= f.collection_select :pet_id, Pet.where(:user_id => current_user.id), :id, :name %>
---
SELECT "pets".* FROM "pets" WHERE "pets"."user_id" = $1  [["user_id", 3]]