app/views/posts/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---

      <% pre_like = @post.likes.find { |like| like.user_id == current_user.id} %>