app/controllers/comments_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
INSERT INTO "comments" ("message", "user_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["message", ""], ["user_id", 3], ["post_id", 12], ["created_at", "2019-12-23 19:24:14.309167"], ["updated_at", "2019-12-23 19:24:14.309167"]]
---
  def create
    @post = Post.find(params[:post_id])
    @post.comments.create(comment_params.merge(user: current_user))