app/controllers/pets_controller.rb

  def create
    @pet = Pet.new(pet_params)
    @pet.user = current_user

    respond_to do |format|
      if @pet.save
---
INSERT INTO "pets" ("name", "user_id", "breed", "species", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Mr Tinklestein"], ["user_id", 8], ["breed", "Main Coon"], ["species", "cat"], ["created_at", "2019-12-24 20:39:48.616424"], ["updated_at", "2019-12-24 20:39:48.616424"]]

    def set_pet
      @pet = Pet.find(params[:id])
---
SELECT  "pets".* FROM "pets" WHERE "pets"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]