app/controllers/posts_controller.rb

  def index
    @posts = Post.timeline(current_user).order('created_at DESC').paginate(page: params[:page], per_page: 10)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."user_id" IS NULL AND "posts"."user_id" IS NULL ORDER BY created_at DESC LIMIT $1 OFFSET $2  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = $1  [["user_id", 8]]