app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" ORDER BY RANDOM() LIMIT $1  [["LIMIT", 1]]
---
  def index
    @posts = Post.all