app/controllers/recommendations_controller.rb

SELECT  "posts".* FROM "posts" ORDER BY "posts"."id" DESC LIMIT $1  [["LIMIT", 50]]
---
  def index
    posts = Post.last(50)