app/controllers/registrations_controller.rb

  def create
    super
    @new_pet = Pet.create(name: 'other', user_id: resource.id, breed: 'other', species: 'other')
    # current_user didn't work here, so used resource to access the current_user info.
    resource.pet_id = @new_pet.id
    resource.save
---
INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at", "username") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
INSERT INTO "pets" ("name", "user_id", "breed", "species", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "other"], ["user_id", 50], ["breed", "other"], ["species", "other"], ["created_at", "2019-12-30 06:07:00.755494"], ["updated_at", "2019-12-30 06:07:00.755494"]]
INSERT INTO "pets" ("name", "user_id", "breed", "species", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "other"], ["user_id", 8], ["breed", "other"], ["species", "other"], ["created_at", "2019-12-30 05:46:22.808600"], ["updated_at", "2019-12-30 05:46:22.808600"]]
UPDATE "users" SET "updated_at" = $1, "sign_in_count" = $2, "current_sign_in_at" = $3, "last_sign_in_at" = $4, "current_sign_in_ip" = $5, "last_sign_in_ip" = $6 WHERE "users"."id" = $7